Repository: nick-traeger/viacrypt
Catalog: locale/*/messages.po
Languages: br

source: ViaCRYPT - Message read on
br: ViaCRYPT - Mensagem lida em

source: The message
br: A mensagem

source: identified as
br: identificada por

source: you wrote on
br: que você escreveu em

source: was just read.
br: acabou de ser lida.

source: ViaCRYPT Team
br: Equipe ViaCRYPT

source: 40 Dr. Anibal Moreira Street, Tijuca
br: Rua Dr. Aníbal Moreira, 40 - Tijuca

source: Rio de Janeiro, RJ | Brazil
br: Rio de Janeiro, RJ | Brasil

source: Zip Code: 20510-110
br: CEP: 20510-110

source: ViaCRYPT is a free system of exchange of encrypted messages, developed by Vialink, a brazilian benchmark company in the IT market.
br: O ViaCRYPT é um sistema gratuito de trocas de mensagens criptografadas, desenvolvido pela Vialink, empresa brasileira referência no mercado de TI.

source: What is it and how does it work?
br: O que é e como funciona?

source: Examples of use
br: Exemplos de uso

source: Explanation for nerds
br: Explicação para nerds

source: Contact Us
br: Entre em contato

source: Type your secret message here...
br: Digite sua mensagem secreta aqui...

source: Please, notify me when my message is read.
br: Por favor, notifique-me quando minha mensagem for lida.

source: Note that your email address will be stored unencrypted in our servers until the notification is sent.
br: Note que seu e-mail será armazenado sem criptografia em nossos servidores até que a notificação seja enviada.

source: Your email address:
br: Seu endereço de e-mail:

source: and optional label:
br: e lembrete opcional:

source: Save it
br: Salvar

source: Single-use URL:
br: URL de uso único:

source: IMPORTANT
br: IMPORTANTE

source: This message can be read only once and will be deleted on the first read.
br: Essa mensagem pode ser lida apenas uma vez e será apagada depois da primeira leitura.

source: Developed by
br: Desenvolvido por

source: Your message is...
br: Sua mensagem é…

source: REMEMBER
br: LEMBRE-SE

source: This message has been deleted and cannot be read again.
br: Essa mensagem foi deletada e não pode ser lida novamente.

source: Close
br: Fechar

source: Message not found
br: Mensagem não encontrada

source: This message has already been read or has never been existed.
br: Essa mensagem já foi lida ou nunca existiu.

source: You should ask the sender to send it again.
br: Você deve pedir ao remetente para enviá-la novamente.

source: This app is an encrypted messaging system where the recipient can read the message only once. After the reading, the message is deleted and cannot be retrieved anymore.
br: Este aplicativo é um sistema de mensagens criptografadas onde o destinatário pode ler a mensagem apenas uma vez. Após a leitura, a mensagem é apagada e não pode mais ser recuperada.

source: The message is encrypted in your browser and stored into our servers. The key to decrypt the message is inside the generated URL and no one, but you and the recipient, has it. Thus, it is impossible to anyone, even us or any government to read the content of your message.
br: A mensagem é criptografada em seu navegador e armazenada nos nossos servidores. A chave para decifrar a mensagem está dentro da URL gerada e ninguém, além de você e o destinatário tem ela. Assim, é impossível para qualquer pessoa, mesmo nós ou qualquer governo ler o conteúdo de sua mensagem.

source: The encryption system is so strong that all computers in the world together would take much more than one trillion years to break it. You can have more information about it
br: O sistema de criptografia é tão forte que todos os computadores do mundo juntos levariam muito mais de um trilhão de anos para quebrá-la. Você pode ter mais informações sobre isso

source: here
br: aqui

source: You can check the code yourself whether you`re curious or just want to run it at home, it`s available at
br: Você pode verificar o código por conta própria, esteja você curioso ou simplesmente queira executá-lo em casa, ele está disponível em

source: When you are sending any password to someone, it is more secure to generate an encrypted message and send only the URL. Thus, if you send by e-mail and someone in the future get access to the e-mail, the invader won`t have the password. Or else, if you send it through GTalk, Facebook Chat or Skype, your password isn`t stored in their databases.
br: Ao enviar alguma senha para alguém, é mais seguro gerar uma mensagem criptografada e enviar apenas a URL. Assim, se você enviar por e-mail e alguém, no futuro, tiver acesso ao e-mail, o invasor não terá a senha. Ou então, se você enviá-la através GTalk, Facebook Chat ou Skype, a senha não é armazenada em seus bancos de dados.

source: You can create a message with a single word and send the URL to many friends. The first to open the message gets the word and wins some prize.
br: Você pode criar uma mensagem com uma única palavra e enviar a URL para muitos amigos. O primeiro a abrir a mensagem obtém a palavra e ganha algum prêmio.

source: Be creative!
br: Seja criativo!

source: You can use it in many ways. Don`t forget to let us know how you are using it :)
br: Você pode usar de muitas maneiras. Não se esqueca de nos contar como você está usando :)

source: For nerds..
br: Para nerds...

source: The message is encrypted using AES and has a 256-bit key as passphrase. The passphrase is randomly generated at your browser, then the message is encrypted and stored into our servers through an unique identifier. The generated URL is composed of two parts: the unique identified and the random passphrase. Both are in the fragment of the URL and are not sent to our webserver when the URL is opened.
br: A mensagem é criptografada usando AES e tem uma chave de 256 bits como senha. A senha é gerada aleatoriamente no seu navegador, em seguida, a mensagem é criptografada e armazenada em nossos servidores através de um identificador único. A URL gerada é composto de duas partes: o identificador único e a chave aleatória. Ambos estão no fragmento da URL e não são enviados para o nosso servidor quando a URL é aberta.

source: When the generated URL is opened, a javascript code parses the URL and retrieve the message by its unique identifier. The servers return the message and delete it at once. Then, the message is decrypted in your browser using the passphrase and is presented to you. If you try to open the same message again, our servers will return a 404 status code because the message no longer exists.
br: Quando a URL gerada é aberta, um código javascript analisa a URL e recuperar a mensagem por seu identificador único. Os servidores retornam a mensagem e a apagam de uma só vez. Então, a mensagem é decodificada em seu navegador usando a chave e é apresentada a você. Se você tentar abrir a mesma mensagem novamente, nossos servidores irão retornar um código de status 404 porque a mensagem não existe mais.

source: One can argue that someone might retrieve your message and make it unavailable to you. Although it is possible, the unique identifiers are randomly generated using RFC4122 v4 UUID and the probability of a random hit is about 8.64E-78.
br: Pode-se argumentar que alguém pode recuperar a sua mensagem e torná-la indisponível para você. Embora isso seja possível, os identificadores únicos são gerados aleatoriamente usando a RFC4122 UUID v4 e a probabilidade de colisão ao acaso é de cerca de 8.64E-78.

source: Contact Information
br: Informações de contato

source: You can contact us by e-mail
br: Você pode nos contactar por e-mail

source: Rate limit exceeded
br: Taxa limite excedida

source: Too many messages. Try again in
br: Muitas mensagens. Tente novamente em

source: minute
br: minuto

source: Something went wrong
br: Algo errado ocorreu

source: Sorry but something went wrong. Please try again.
br: Desculpe mas algo errado ocorreu. Por favor tente novamente.
